export const categoryItems = [
  {
    id: "0",
    name: "مد و پوشاک",
    items: ["زنانه", "مردانه"],
  },
  {
    id: "1",
    name: "خانه و آشپز خانه",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "2",
    name: "ابزار",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "3",
    name: "موبایل",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "4",
    name: "کالا های دیجیتال",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "5",
    name: "ورزش و سفر",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "6",
    name: "کالا های سوپر مارکتی",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "7",
    name: "زیبایی و سلامت",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "8",
    name: "کتاب و لوازم تحریر",
    items: ["دخترانه", "مردانه"],
  },
];
