export const categoryItems = [
  {
    id: "0",
    name: "مد و پوشاک",
    items: ["زنانه", "مردانه", "بچگانه"],
  },
  {
    id: "1",
    name: "خانه و آشپز خانه",
    items: [
      "صوتی و تصویری",
      "خواب",
      "فرش و گلیم",
      "روشنایی و الکتریکی",
      "آشپزخانه",
    ],
  },
  {
    id: "2",
    name: "ابزار",
    items: [
      "تجهیزات صنعتی و انبارداری",
      "باغبانی و کشاورزی",
      "لوازم یدکی ووسایل نقلیه",
      "ابزار برقی",
      "یراق آلات",
    ],
  },
  {
    id: "3",
    name: "موبایل",
    items: ["آیفون", "سامسونگ", "شیاعومی", "نوکیا"],
  },
  {
    id: "4",
    name: "کالا های دیجیتال",
    items: [
      "تبلت",
      "لپتاپ",
      "دوربین",
      " ساعت و مچ بند هوشمند",
      "لوازم جانبی کالای دیجیتال",
    ],
  },
  {
    id: "5",
    name: "ورزش و سفر",
    items: ["تجهیزات سفر", "لوازم ورزش", "لوازم سفر و کمپینگ"],
  },
  {
    id: "6",
    name: "کالا های سوپر مارکتی",
    items: [
      "لبنیات",
      "پروتئینی",
      "کالا های اساسی",
      "میوه و سبزیجات",
      "تنقلات",
      "نوشیدنی های گرم",
    ],
  },
  {
    id: "7",
    name: "زیبایی و سلامت",
    items: ["دخترانه", "مردانه"],
  },
  {
    id: "8",
    name: "کتاب و لوازم تحریر",
    items: ["کتاب", "لوازم تحریر"],
  },
];
